# 数据库连接
DB_CONFIG = {

}

# 按照各个客户文件归档的依据字典
CUS_FILE_RANGE = {
            '基本资料': ['执照', '章程', '开户', '身份证'],
            '财务资料': {
                '财务账表': ['财务报表', '资产负债表', '利润表', '现金流量表', '损益表', '科目余额', '明细账', '序时账', '账套', '会计准则', 'CWBB'],
                '银行流水': ['网银', '银行', '流水', '对账单', '回单', '招行', '民生', '工行', '建行', '农行', '华夏'],
                '电子发票': ['电子发票'],
            },
            '税务资料': {
                '申报表' : ['申报', '纳税', 'YBNSR', '报税', 'ZZS', 'QYSD', '工资薪金', '完税证明', '劳务报酬'],
                '进项明细': ['进项', '抵扣', '认证', '勾选'],
                '税务档案': ['申报', '纳税', 'YBNSR', '报税', 'ZZS', 'QYSD', '工资薪金', '完税证明', '劳务报酬']
            },
            '其他资料': []
        }

# 编写工资计提及发放分录字典
Finance_Dict = {
    '1、计提管理工资社保公积金': {
        '借': {
            '管理费用-工资': 0,
            '管理费用-社保': 0,
            '管理费用-公积金': 0
        },
        '贷': {
            '应付职工薪酬-工资': 0,
            '应付职工薪酬=社保': 0,
            '应付职工薪酬-公积金': 0,
            '其他应付款-代扣社保': 0,
            '其他应付款-代扣公积金': 0,
            '应交税费-应交个人所得税': 0
        }
    },
    '2、计提销售工资社保公积金': {
        '借': {
            '销售费用-工资': 0,
            '销售费用-社保': 0,
            '销售费用-公积金': 0
        },
        '贷': {
            '应付职工薪酬-工资': 0,
            '应付职工薪酬=社保': 0,
            '应付职工薪酬-公积金': 0,
            '其他应付款-代扣社保': 0,
            '其他应付款-代扣公积金': 0,
            '应交税费-应交个人所得税': 0
        }
    }
}