PERSON_PAYROLL={
    'pfc': {
            '基本工资': 0,
            '绩效工资': 0,
            '奖金': 0,
            '其他收入': 0,
            '扣款': 0,
            '应发工资':0,
            '养老': 0,
            '失业': 0,
            '医疗': 0,
            '公积金': 0,
            '个人所得税': 0,
            '实发工资': 0
        }, 
    'lr': {
            '基本工资': 0,
            '绩效工资': 0,
            '奖金': 0,
            '其他收入': 0,
            '扣款': 0,
            '应发工资':0,
            '养老': 0,
            '失业': 0,
            '医疗': 0,
            '公积金': 0,
            '个人所得税': 0,
            '实发工资': 0
        }
}